app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "users" SET "name" = 'New Name', "email" = 'new@example.com', "password_digest" = '$2a$04$cBQ9gi8y8jE0mI2YId9CyeHh6HEIJmxvFzEc017nsWE40H4uSRb8y', "remember_token" = 'nccjIXGt653tqSRzkV8bjQ', "updated_at" = '2012-06-12 05:09:44.678618' WHERE "users"."id" = 1
---
  def update
      @user = User.find(params[:id])
      if @user.update_attributes(params[:user])